; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-6-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-2 - location
	p1-4 - location
	p2-5 - location
	p3-0 - location
	p3-2 - location
	p3-6 - location
	p4-3 - location
	p5-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s5)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s0)
	(at package2 s1)
	(at package3 s6)
	(at package4 s3)
	(at package5 s2)
	(at package6 s4)
	(at package7 s1)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s5)
	(at package12 s0)
	(at package13 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 20)
	(= (time-to-walk p1-2 s1) 20)
	(= (time-to-walk s2 p1-2) 89)
	(= (time-to-walk p1-2 s2) 89)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 56)
	(= (time-to-walk p1-4 s1) 56)
	(= (time-to-walk s4 p1-4) 45)
	(= (time-to-walk p1-4 s4) 45)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 26)
	(= (time-to-walk p2-5 s2) 26)
	(= (time-to-walk s5 p2-5) 49)
	(= (time-to-walk p2-5 s5) 49)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 22)
	(= (time-to-walk p3-0 s3) 22)
	(= (time-to-walk s0 p3-0) 94)
	(= (time-to-walk p3-0 s0) 94)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 73)
	(= (time-to-walk p3-2 s3) 73)
	(= (time-to-walk s2 p3-2) 12)
	(= (time-to-walk p3-2 s2) 12)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 18)
	(= (time-to-walk p3-6 s3) 18)
	(= (time-to-walk s6 p3-6) 75)
	(= (time-to-walk p3-6 s6) 75)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 84)
	(= (time-to-walk p4-3 s4) 84)
	(= (time-to-walk s3 p4-3) 29)
	(= (time-to-walk p4-3 s3) 29)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 82)
	(= (time-to-walk p5-1 s5) 82)
	(= (time-to-walk s1 p5-1) 83)
	(= (time-to-walk p5-1 s1) 83)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 64)
	(= (time-to-drive s1 s0) 64)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 84)
	(= (time-to-drive s2 s1) 84)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 90)
	(= (time-to-drive s6 s1) 90)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 72)
	(= (time-to-drive s0 s2) 72)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 91)
	(= (time-to-drive s5 s2) 91)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 24)
	(= (time-to-drive s0 s3) 24)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 48)
	(= (time-to-drive s1 s3) 48)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 7)
	(= (time-to-drive s2 s3) 7)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 12)
	(= (time-to-drive s0 s4) 12)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 51)
	(= (time-to-drive s1 s4) 51)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 40)
	(= (time-to-drive s3 s5) 40)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 21)
	(= (time-to-drive s4 s5) 21)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 78)
	(= (time-to-drive s2 s6) 78)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 73)
	(= (time-to-drive s4 s6) 73)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 14)
	(= (time-to-drive s5 s6) 14)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s4)
	(at driver3 s2)
	(at truck1 s3)
	(at truck2 s0)
	(at truck3 s5)
	(at truck5 s0)
	(at truck6 s1)
	(at package1 s3)
	(at package2 s1)
	(at package3 s5)
	(at package4 s4)
	(at package5 s6)
	(at package6 s1)
	(at package7 s0)
	(at package8 s0)
	(at package9 s0)
	(at package10 s0)
	(at package11 s1)
	(at package12 s2)
	(at package13 s2)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 3  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 21
2. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (driven) from 0 to 14
   goals met: 4 of 21
3. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   goals met: 4 of 21
4. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (driven) from 14 to 28
   goals met: 5 of 21
5. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   goals met: 6 of 21
6. (load-truck package11 truck3 s5)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   goals met: 6 of 21
7. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 28 to 49
   goals met: 5 of 21
8. (drive-truck truck3 s4 s0 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (driven) from 49 to 61
   goals met: 5 of 21
9. (load-truck package12 truck3 s0)
   deleted: (at package12 s0)
   added: (in package12 truck3)
   goals met: 5 of 21
10. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 5 of 21
11. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 61 to 125
   goals met: 5 of 21
12. (unload-truck package11 truck3 s1)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   goals met: 6 of 21
13. (load-truck package7 truck3 s1)
   deleted: (at package7 s1)
   added: (in package7 truck3)
   goals met: 6 of 21
14. (load-truck package13 truck3 s1)
   deleted: (at package13 s1)
   added: (in package13 truck3)
   goals met: 6 of 21
15. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 125 to 189
   goals met: 6 of 21
16. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   goals met: 7 of 21
17. (drive-truck truck3 s0 s4 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (driven) from 189 to 201
   goals met: 7 of 21
18. (load-truck package6 truck3 s4)
   deleted: (at package6 s4)
   added: (in package6 truck3)
   goals met: 7 of 21
19. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 201 to 252
   goals met: 7 of 21
20. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   goals met: 8 of 21
21. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 252 to 336
   goals met: 8 of 21
22. (unload-truck package12 truck3 s2)
   deleted: (in package12 truck3)
   added: (at package12 s2)
   goals met: 9 of 21
23. (unload-truck package13 truck3 s2)
   deleted: (in package13 truck3)
   added: (at package13 s2)
   goals met: 10 of 21
24. (load-truck package9 truck3 s2)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   goals met: 10 of 21
25. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 10 of 21
26. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (driven) from 336 to 414
   goals met: 10 of 21
27. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   goals met: 11 of 21
28. (drive-truck truck3 s6 s2 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (driven) from 414 to 492
   goals met: 11 of 21
29. (walk driver1 s4 p4-3)
   deleted: (at driver1 s4)
   added: (at driver1 p4-3)
   changed: (walked) from 0 to 84
   goals met: 11 of 21
30. (walk driver1 p4-3 s3)
   deleted: (at driver1 p4-3)
   added: (at driver1 s3)
   changed: (walked) from 84 to 113
   goals met: 11 of 21
31. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 492 to 564
   goals met: 11 of 21
32. (walk driver1 s3 p3-6)
   deleted: (at driver1 s3)
   added: (at driver1 p3-6)
   changed: (walked) from 113 to 131
   goals met: 11 of 21
33. (unload-truck package9 truck3 s0)
   deleted: (in package9 truck3)
   added: (at package9 s0)
   goals met: 12 of 21
34. (walk driver1 p3-6 s6)
   deleted: (at driver1 p3-6)
   added: (at driver1 s6)
   changed: (walked) from 131 to 206
   goals met: 13 of 21
35. (drive-truck truck3 s0 s3 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 564 to 588
   goals met: 13 of 21
36. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 14 of 21
37. (load-truck package4 truck3 s3)
   deleted: (at package4 s3)
   added: (in package4 truck3)
   goals met: 14 of 21
38. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 588 to 595
   goals met: 14 of 21
39. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 15 of 21
40. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 15 of 21
41. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 21
42. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 14 of 21
43. (board-truck driver1 truck5 s6)
   deleted: (at driver1 s6) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 13 of 21
44. (drive-truck truck5 s6 s1 driver1)
   deleted: (at truck5 s6)
   added: (at truck5 s1)
   changed: (driven) from 595 to 685
   goals met: 13 of 21
45. (drive-truck truck5 s1 s0 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (driven) from 685 to 749
   goals met: 14 of 21
46. (disembark-truck driver1 truck5 s0)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 14 of 21
47. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 14 of 21
48. (drive-truck truck6 s0 s1 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   changed: (driven) from 749 to 813
   goals met: 15 of 21
49. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 813 to 885
   goals met: 16 of 21
50. (drive-truck truck6 s1 s6 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s6)
   changed: (driven) from 885 to 975
   goals met: 15 of 21
51. (drive-truck truck6 s6 s2 driver1)
   deleted: (at truck6 s6)
   added: (at truck6 s2)
   changed: (driven) from 975 to 1053
   goals met: 15 of 21
52. (disembark-truck driver1 truck6 s2)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 15 of 21
53. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 21
54. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 1053 to 1125
   goals met: 14 of 21
55. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 15 of 21
56. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   goals met: 15 of 21
57. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (driven) from 1125 to 1203
   goals met: 15 of 21
58. (board-truck driver3 truck6 s2)
   deleted: (at driver3 s2) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 14 of 21
59. (disembark-truck driver1 truck3 s6)
   deleted: (driving driver1 truck3)
   added: (at driver1 s6) (empty truck3)
   goals met: 15 of 21
60. (load-truck package4 truck6 s2)
   deleted: (at package4 s2)
   added: (in package4 truck6)
   goals met: 15 of 21
61. (drive-truck truck6 s2 s1 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   changed: (driven) from 1203 to 1287
   goals met: 16 of 21
62. (board-truck driver1 truck3 s6)
   deleted: (at driver1 s6) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 21
63. (drive-truck truck6 s1 s4 driver3)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   changed: (driven) from 1287 to 1338
   goals met: 14 of 21
64. (unload-truck package4 truck6 s4)
   deleted: (in package4 truck6)
   added: (at package4 s4)
   goals met: 15 of 21
65. (drive-truck truck3 s6 s2 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (driven) from 1338 to 1416
   goals met: 15 of 21
66. (drive-truck truck6 s4 s1 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (driven) from 1416 to 1467
   goals met: 16 of 21
67. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 16 of 21
68. (disembark-truck driver3 truck6 s1)
   deleted: (driving driver3 truck6)
   added: (at driver3 s1) (empty truck6)
   goals met: 16 of 21
69. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   changed: (walked) from 206 to 226
   goals met: 16 of 21
70. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   changed: (walked) from 226 to 315
   goals met: 17 of 21
71. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 17 of 21
72. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (driven) from 1467 to 1474
   goals met: 18 of 21
73. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 17 of 21
74. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 17 of 21
75. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 18 of 21
76. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 17 of 21
77. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 1474 to 1546
   goals met: 18 of 21
78. (walk driver1 s3 p3-2)
   deleted: (at driver1 s3)
   added: (at driver1 p3-2)
   changed: (walked) from 315 to 388
   goals met: 18 of 21
79. (walk driver1 p3-2 s2)
   deleted: (at driver1 p3-2)
   added: (at driver1 s2)
   changed: (walked) from 388 to 400
   goals met: 18 of 21
80. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 1546 to 1618
   goals met: 17 of 21
81. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 18 of 21
82. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 18 of 21
83. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 1618 to 1690
   goals met: 19 of 21
84. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 18 of 21
85. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 18 of 21
86. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (driven) from 1690 to 1768
   goals met: 18 of 21
87. (walk driver1 s0 p3-0)
   deleted: (at driver1 s0)
   added: (at driver1 p3-0)
   changed: (walked) from 400 to 494
   goals met: 18 of 21
88. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (driven) from 1768 to 1782
   goals met: 19 of 21
89. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 19 of 21
90. (walk driver3 s5 p2-5)
   deleted: (at driver3 s5)
   added: (at driver3 p2-5)
   changed: (walked) from 494 to 543
   goals met: 19 of 21
91. (walk driver3 p2-5 s2)
   deleted: (at driver3 p2-5)
   added: (at driver3 s2)
   changed: (walked) from 543 to 569
   goals met: 20 of 21
92. (walk driver1 p3-0 s3)
   deleted: (at driver1 p3-0)
   added: (at driver1 s3)
   changed: (walked) from 569 to 591
   goals met: 20 of 21
93. (walk driver1 s3 p3-6)
   deleted: (at driver1 s3)
   added: (at driver1 p3-6)
   changed: (walked) from 591 to 609
   goals met: 20 of 21
94. (walk driver1 p3-6 s6)
   deleted: (at driver1 p3-6)
   added: (at driver1 s6)
   changed: (walked) from 609 to 684
   goals met: 21 of 21
